In [1]:
import pandas as pd

In [2]:
country_data=pd.read_csv("countries-aggregated.csv")

In [3]:
country_data.head()

         Date      Country  Confirmed  Recovered  Deaths
0  2020-01-22  Afghanistan          0          0       0
1  2020-01-23  Afghanistan          0          0       0
2  2020-01-24  Afghanistan          0          0       0
3  2020-01-25  Afghanistan          0          0       0
4  2020-01-26  Afghanistan          0          0       0

In [4]:
country_data.tail()

              Date   Country  Confirmed  Recovered  Deaths
161563  2022-04-12  Zimbabwe     247094          0    5460
161564  2022-04-13  Zimbabwe     247160          0    5460
161565  2022-04-14  Zimbabwe     247208          0    5462
161566  2022-04-15  Zimbabwe     247237          0    5462
161567  2022-04-16  Zimbabwe     247237          0    5462

In [5]:
country_data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 161568 entries, 0 to 161567
Data columns (total 5 columns):
 #   Column     Non-Null Count   Dtype
---  ------     --------------   -----
 0   Date       161568 non-null  object
 1   Country    161568 non-null  object
 2   Confirmed  161568 non-null  int64
 3   Recovered  161568 non-null  int64
 4   Deaths     161568 non-null  int64
dtypes: int64(3), object(2)
memory usage: 6.2+ MB

In [6]:
country_data["Date"]

0         2020-01-22
1         2020-01-23
2         2020-01-24
3         2020-01-25
4         2020-01-26
             ...
161563    2022-04-12
161564    2022-04-13
161565    2022-04-14
161566    2022-04-15
161567    2022-04-16
Name: Date, Length: 161568, dtype: object

In [7]:
country_data["Date"]=pd.to_datetime(country_data["Date"])

In [8]:
country_data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 161568 entries, 0 to 161567
Data columns (total 5 columns):
 #   Column     Non-Null Count   Dtype
---  ------     --------------   -----
 0   Date       161568 non-null  datetime64[ns]
 1   Country    161568 non-null  object
 2   Confirmed  161568 non-null  int64
 3   Recovered  161568 non-null  int64
 4   Deaths     161568 non-null  int64
dtypes: datetime64[ns](1), int64(3), object(1)
memory usage: 6.2+ MB

In [9]:
country_data["Country"].nunique()

198

In [10]:
type(country_data.loc[161564])

pandas.core.series.Series

In [11]:
country_data.loc[161564]

Date         2022-04-13 00:00:00
Country                 Zimbabwe
Confirmed                 247160
Recovered                      0
Deaths                      5460
Name: 161564, dtype: object

In [24]:
country_data.set_index("Country").loc["India"]

              Date  Confirmed  Recovered  Deaths
Country
India   2020-01-22          0          0       0
India   2020-01-23          0          0       0
India   2020-01-24          0          0       0
India   2020-01-25          0          0       0
India   2020-01-26          0          0       0
...            ...        ...        ...     ...
India   2022-04-12   43038016          0  521736
India   2022-04-13   43039023          0  521737
India   2022-04-14   43039972          0  521743
India   2022-04-15   43040947          0  521747
India   2022-04-16   43042097          0  521751

[816 rows x 4 columns]

In [25]:
ind_data=country_data.set_index("Country").loc["India"]

In [26]:
ind_data

              Date  Confirmed  Recovered  Deaths
Country
India   2020-01-22          0          0       0
India   2020-01-23          0          0       0
India   2020-01-24          0          0       0
India   2020-01-25          0          0       0
India   2020-01-26          0          0       0
...            ...        ...        ...     ...
India   2022-04-12   43038016          0  521736
India   2022-04-13   43039023          0  521737
India   2022-04-14   43039972          0  521743
India   2022-04-15   43040947          0  521747
India   2022-04-16   43042097          0  521751

[816 rows x 4 columns]

In [15]:
#country_data = country_data.query("(Country == 'India')")

In [16]:
country_data

             Date      Country  Confirmed  Recovered  Deaths
0      2020-01-22  Afghanistan          0          0       0
1      2020-01-23  Afghanistan          0          0       0
2      2020-01-24  Afghanistan          0          0       0
3      2020-01-25  Afghanistan          0          0       0
4      2020-01-26  Afghanistan          0          0       0
...           ...          ...        ...        ...     ...
161563 2022-04-12     Zimbabwe     247094          0    5460
161564 2022-04-13     Zimbabwe     247160          0    5460
161565 2022-04-14     Zimbabwe     247208          0    5462
161566 2022-04-15     Zimbabwe     247237          0    5462
161567 2022-04-16     Zimbabwe     247237          0    5462

[161568 rows x 5 columns]

In [17]:
country_data
#masking

             Date      Country  Confirmed  Recovered  Deaths
0      2020-01-22  Afghanistan          0          0       0
1      2020-01-23  Afghanistan          0          0       0
2      2020-01-24  Afghanistan          0          0       0
3      2020-01-25  Afghanistan          0          0       0
4      2020-01-26  Afghanistan          0          0       0
...           ...          ...        ...        ...     ...
161563 2022-04-12     Zimbabwe     247094          0    5460
161564 2022-04-13     Zimbabwe     247160          0    5460
161565 2022-04-14     Zimbabwe     247208          0    5462
161566 2022-04-15     Zimbabwe     247237          0    5462
161567 2022-04-16     Zimbabwe     247237          0    5462

[161568 rows x 5 columns]

In [18]:
mask=(country_data["Country"]=="India") & (country_data["Date"]=="2021-06-22")

In [19]:
mask

0         False
1         False
2         False
3         False
4         False
          ...
161563    False
161564    False
161565    False
161566    False
161567    False
Length: 161568, dtype: bool

In [20]:
country_data[mask]

            Date Country  Confirmed  Recovered  Deaths
65797 2021-06-22   India   30028709   28994855  390660

In [21]:
country_data.query("(Country=='Zimbabwe') & (Date == '2021-06-22')")

             Date   Country  Confirmed  Recovered  Deaths
161269 2021-06-22  Zimbabwe      42714      37288    1691

In [59]:
split1=country_data.iloc[20:]
split1

             Date  Country  Confirmed  Recovered  Deaths
20     2020-02-11      NaN          0          0       0
21     2020-02-12      NaN          0          0       0
22     2020-02-13      NaN          0          0       0
23     2020-02-14      NaN          0          0       0
24     2020-02-15      NaN          0          0       0
...           ...      ...        ...        ...     ...
161563 2022-04-12      NaN     247094          0    5460
161564 2022-04-13      NaN     247160          0    5460
161565 2022-04-14      NaN     247208          0    5462
161566 2022-04-15      NaN     247237          0    5462
161567 2022-04-16      NaN     247237          0    5462

[161548 rows x 5 columns]

In [62]:
split2=country_data.iloc[1:20]
split2

         Date  Country  Confirmed  Recovered  Deaths
1  2020-01-23      NaN          0          0       0
2  2020-01-24      NaN          0          0       0
3  2020-01-25      NaN          0          0       0
4  2020-01-26      NaN          0          0       0
5  2020-01-27      NaN          0          0       0
6  2020-01-28      NaN          0          0       0
7  2020-01-29      NaN          0          0       0
8  2020-01-30      NaN          0          0       0
9  2020-01-31      NaN          0          0       0
10 2020-02-01      NaN          0          0       0
11 2020-02-02      NaN          0          0       0
12 2020-02-03      NaN          0          0       0
13 2020-02-04      NaN          0          0       0
14 2020-02-05      NaN          0          0       0
15 2020-02-06      NaN          0          0       0
16 2020-02-07      NaN          0          0       0
17 2020-02-08      NaN          0          0       0
18 2020-02-09      NaN          0          0       0
19 2020-02-10      NaN          0          0       0

In [72]:
cv=split1.merge(split2 , how='left') #left join
cv

             Date  Country  Confirmed  Recovered  Deaths
0      2020-02-11      NaN          0          0       0
1      2020-02-12      NaN          0          0       0
2      2020-02-13      NaN          0          0       0
3      2020-02-14      NaN          0          0       0
4      2020-02-15      NaN          0          0       0
...           ...      ...        ...        ...     ...
161543 2022-04-12      NaN     247094          0    5460
161544 2022-04-13      NaN     247160          0    5460
161545 2022-04-14      NaN     247208          0    5462
161546 2022-04-15      NaN     247237          0    5462
161547 2022-04-16      NaN     247237          0    5462

[161548 rows x 5 columns]

In [ ]:
country_data_split=pd.read_csv("key-countries-pivoted.csv")

In [63]:
country_data_split

,Date,China,US,United_Kingdom,Italy,France,Germany,Spain,Iran
0,2020-01-22,548,1,0,0,0,0,0,0
1,2020-01-23,643,1,0,0,0,0,0,0
2,2020-01-24,920,2,0,0,2,0,0,0
3,2020-01-25,1406,2,0,0,3,0,0,0
4,2020-01-26,2075,5,0,0,3,0,0,0
...,...,...,...,...,...,...,...,...,...
811,2022-04-12,1655477,80477797,21846115,15404809,27353225,23017079,11627487,7197505
812,2022-04-13,1681437,80518989,21883579,15467395,27499728,23182447,11627487,7199861
813,2022-04-14,1705231,80573532,21916961,15533012,27637292,23339311,11627487,7202055
814,2022-04-15,1759128,80612681,21916961,15595302,27762686,23376879,11627487,7204049
815,2022-04-16,1760211,80625120,21916961,15659835,27874269,23416663,11627487,7205064